[{"comments": ["\n    \t\t\t\tMy vertigo started 15 weeks ago.  I was diagnosed (after many doctors) with BPPV and vestibular nerve damage.   I had PT (physical therapy-the epley procedure ) for the BPPV a month ago and no longer have the crystals.  I am still woozy-not dizzy like I was earlier.   It almost feels like I am going to get very dizzy but I don't.   The PT thinks my brain needs to adjust to the nerve damage (it is only working at 48%).  Everyone I talk to who has had vertigo or the crystals said they just felt better, not this wooziness I am experiencing.  Has anyone experienced  this?  How long did it take you to get better, and how did you get better?  I have been to ENT- tested with ENG/VNG, blood tests, tried meclizine, herbs, accupuncuture, MD-four times, and am currently going to a chiropractor.  I have also been cutting down my sugar, alcohol and salt.  Any help or advice you can give would be greatly appreciated.  I don't think I have allergies, since my breathing is fine and I don't have pressure in my ears but am considering being  tested.\n    \t\t\t", "\n    \t\t\t\tI feel for you.\r", "\r", "I have Meniere's Disease...it's an inner ear thing.\r", "I have tinnitus that comes and goes, vertigo, nausea, etc.\r", "My allergies make it worse...however because I'm not a child, I can't find a doctor that will send me in for allergy testing...so I have no idea ( except for the snow molds allergy that I KNOW I have) what is setting it off the rest of the year.\r", "I know that wind ( including blow dryers) set it off, heights ( altitude changes) and water in my ears can set it off too.\r", "I know that it has something to do with the \"crystals\" in the inner ear shifting, but other than that...\r", "I find that SERC helps with the vertigo and ear pressure.\r", "And also...allergies don't necessarily mean that you're going to have breathing issues.\r", "Get the tests done if you can.\r", "Good luck. \r", "\n    \t\t\t", "\n    \t\t\t\tThank you\n    \t\t\t", "\n    \t\t\t\tI have been going through the exact same thing for 7 weeks . As you say , I am now not dizzy but I am  feel woozy when I have to look up or down , this after doing the Epley maneuver for 3 straight weeks . \r", "My positional vertigo was , in the past  , only when in bed and I turned to the left . \r", "Now it is when I turn to the right .\r", "Upon rising in the A.M.  I have no signs of it until I am up for about 3 hours , and it returns .\r", "I have an appointment with my Neurologist tomorrow but i don't have any confidence that she  can help me . It's not her fault  , I just know that the constant ringing in my ears and feeling of my ears being clogged  have no real medical treatment that's going to help me . \r", "I too take Meclizine to no avail .\n    \t\t\t"]}]